// Задача 2: Напишите программу, которая на вход принимает два числа и выдает, какое число большее, а какое меньшее.
Console.WriteLine("Ho!!!");
int a = Convert.ToInt32(Console.ReadLine());
Console.WriteLine(a);
int b = Convert.ToInt32(Console.ReadLine());
Console.WriteLine("Ho!!!" + b);
if (a > b) {Console.WriteLine("max = " + a);}
else {Console.WriteLine("max = " + b);}
