// Задача 66: Задайте значения M и N. Напишите программу, которая найдёт сумму натуральных элементов в промежутке от M до N.
int m = 4;
int n = 8;
Console.WriteLine((m + n) * (n - m + 1) / 2);